src/cf/Catalogs/БизнесРегионы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>БизнесРегионы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CRM_КодГорода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_КодКЛАДР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_КодСтраны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Платежеспособность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_Платежеспособность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ЧисленностьНаселения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_КодПоКлассификатору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_КодОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ВремяПоГринвичу_GMT</Name>
					<Comment>Время региона относительно времени по Гринвичу (например, Москва: +4)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/CRM_Платежеспособность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_Платежеспособность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Низкая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Средняя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Высокая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/БизнесРегионы/Forms/CRM_ФормаЭлемента/Ext/Form/Module.bsl
// Процедура формирует представление.
//
// Параметры:
//	Нет.
//
&НаКлиенте
Процедура СформироватьПредставление()
	Элементы.Представление.Заголовок = "+" + Объект.CRM_КодСтраны + " (" + Объект.CRM_КодГорода + ")";	
КонецПроцедуры	// СформироватьПредставление()

// Процедура-обработчик события "ПриИзменении" поля ввода "CRM_КодСтраны".
//
&НаКлиенте
Процедура CRM_КодСтраныПриИзменении(Элемент)
	Если ПустаяСтрока(Объект.CRM_КодСтраны) Тогда Возврат; КонецЕсли;
	СформироватьПредставление();
КонецПроцедуры // CRM_КодСтраныПриИзменении()

// Процедура-обработчик события "ПриИзменении" поля ввода "CRM_КодГорода".
//
&НаКлиенте
Процедура CRM_КодГородаПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры // CRM_КодГородаПриИзменении()

// Процедура-обработчик события "ПриСозданииНаСервере"
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.CRM_КодСтраны = "7";
		Объект.CRM_Платежеспособность = Перечисления.CRM_Платежеспособность.Средняя;
	КонецЕсли;
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура-обработчик события "ПриОткрытии"
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьПредставление();
КонецПроцедуры // ПриОткрытии()
